{
    "Information" : {
        "Name" : "Worcester Polytechnic Institute",
        "Location" : "Worcester, Massachusetts, USA",
        "Schedule Type" : "4 terms, 7 weeks each",
        "ID2050 Information" : "ID2050 is a required course for all WPI students. It must be taken the term before the student begins their IQP, unless the IQP is over 3 terms or the student is doing an on-campus IQP.",
        "IQP Information" : "The Interactive Qualifying Project (IQP) is a unique project-based requirement at WPI that integrates science, technology, and society. Students collaberate with a sponsor for their IQP. Students can choose to complete their IQP either on-campus or off-campus, and it typically spans multiple terms. The IQP encourages students to apply their technical knowledge to real-world problems while considering social, cultural, and ethical implications.",
        "MQP Information" : "The Major Qualifying Project (MQP) is a capstone project that serves as a culmination of a student's academic experience at WPI. It allows students to work on a significant technical project, often in collaboration with a professor at WPI.",
        "Overload Information" : "Typically, WPI students take 3 courses per term. However, students have the option to overload and take 4 courses in a term. Overloading is not permitted if the student is taking IQP, MQP, or ID2050 during that term.",
        "Insight Information" : "Insight is a first year experience at WPI. It is a 2 term program that gives the student 1 credit of Wellness and Physical Education (WPE). It does not count as a course for the term load.",
        "Double Counting" : "Students can double count some courses for BS/MS program. They must fill out a form to do so.",
        "Calculus" : "WPI allows students to take higher level calculus courses without taking the lower levels. If a student passes a higher level calculus course, they will receive credit for the lower level courses as well."
    },

    "Major" : {
        "BS Computer Science" : {
            "Humanities" : "6 courses. 3 courses from the same department, then 1 from a different department, and then 1 more from any department. Finally humanities seminar. If a student does all 6 courses in a foreign language, they do not need to do a humanities seminar. Departments AR, EN/TH, MU, AB, CN, GN, SP, WR, RH, HI, HU, INTL, PY, RE",
            "Wellness And Physical Education" : "4 courses. Departments include WPE",
            "Social Science" : "2 courses from any department. Departments include ECON, ENV, GOV, PSY, SD, SOC, SS, STS, DEV, and ID2050. ID2050 must be taken unless the IQP is over 3 terms or the student takes an on-campus IQP.",
            "The Interactive Qualifying Project (IQP)" : "Either 1 term or 3. Can be completed off-campus or on-campus. Cannot be overloaded.",
            "Free Electives" : "3 courses. Can be from any department.",
            "Computer Science" : "18 courses, 3 must be the MQP. Must include at least one course from each of the following areas: Systems, Theory and Languages, Design, and Social Implications. Must take 5 CS classes at 4000 level or higher. The remaining courses must be CS 2000 level or higher (CS 1101 or 1102 are the only allowed 1000 level courses). CS 2119 will not count toward the requirement.",
            "Mathematics" : "7 courses. Must take 4 1000 level MA course or higher, must take a 2000 level MA course or higher, must take MA 2621 or 2631, must take MA 2611 or 2612.",
            "Basic Science and/or Engineering Science" : "5 courses. Departments include AE, BB, BME, CE, CH, CHE, ECE, ES, GE, ME, PH, RBE. 3 courses must come from BB, CH, GE, PH where 2 of the courses must be from the same department."
        },
        "BS Data Science" : {
            "Humanities" : "6 courses. 3 courses from the same department, then 1 from a different department, and then 1 more from any department. Finally humanities seminar. If a student does all 6 courses in a foreign language, they do not need to do a humanities seminar. Departments AR, EN/TH, MU, AB, CN, EN, GN, SP, WR, RH, HI, HU, INTL, PY, RE",
            "Wellness And Physical Education" : "4 courses. Departments include WPE",
            "Social Science" : "2 courses from any department. Departments include ECON, ENV, GOV, PSY, SD, SOC, SS, STS, DEV, and ID2050. ID2050 must be taken unless the IQP is over 3 terms or the student takes an on-campus IQP.",
            "The Interactive Qualifying Project (IQP)" : "Either 1 term or 3. Can be completed off-campus or on-campus. Cannot be overloaded.",
            "Free Electives" : "3 courses. Can be from any department.",
            "Data Science Core" : "3 courses. Must take DS 1010, DS 2010, and DS 3010.",
            "Computer Science" : "3 courses. Must take CS 2223. Two other courses must be chosen from CS 1004, CS 1101, CS 1102, CS 2102, CS 2103, CS 2119, or from CS electives listed in the course catalog.",
            "Mathematical Sciences" : "5 courses. Must take MA 2611, MA 2612, and either MA 2071 or MA 2072. Two other courses must be chosen from MA 1020, MA 1021, MA 1022, MA 1120, or from MA electives listed in the catalog.",
            "Business Courses" : "2 courses. Must take BUS 2080 or OIE 2081. One other course must be chosen from OBC 1010, ETR 1100, MIS 3010, or ETR 3633.",
            "Disciplinary Elective Courses" : "11 courses. Electives must include at least 4/3 units (4 courses) at the 4000 level or higher and at least one course in each of the following categories: Databases (CS 3431, CS 4432, MIS 3720, CS 4433/DS 4433), Data mining/machine learning (CS 4445, CS 4342/DS 4342), Business modeling and prediction (MIS 4084, OIE 4430). DS 4099 counts as a disciplinary elective.",
            "Data Privacy and Ethics" : "1 course.",
            "Science" : "2 courses.",
            "MQP" : "3 courses."
        }
    }
}